PREFIXES = {
    "region": [
        "область", "обл",
        "республика", "респ",
        "край",
        "АО",
    ],
    "district": [
        "мо",
        "р-н", "район",
        "а.обл",
        "а.окр",
    ],
    "city": [
        "г"
    ],
    "locality": [
        "аул", "аал",
        "д",
        "днп", "днт", "дп", "дск",
        "ж/м", "жм", "жк",
        "кп", "к.п",
        "массив",
        "мкр",
        "нп", "населенный пункт",
        "с", "сп", "ст", "с/т", "снт", "тсн", "сно", "с/о"
        "ст_ж/д", "ж/д_ст",
        "рп", "р.п",
        "п", "пгт", "пос", "поселок сельского типа", "поселок", "п/ст",
        "промзона",
        "улус", "у",
        "х", "хутор",
    ],
    "street": [
        "аллея",
        "ул", "улица",
        "б-р", "бульвар",
        "г/к", "гк", "гск",
        "кв-л", "квартал",
        "мкрн",
        "сдт", "сдт", "спк",
        "пр-т",
        "пр-кт",
        "пер", "переулок",
        "пр-д",
        "проезд",
        "переезд",
        "пл",
        "туп", "тупик",
        "тер",
        "пр",
        "ш"
    ]
}
